chie4hao/qmk_firmware_nrf52840/tmk_core/protocol/nrf5/usb/fixed/app_usbd_audio_bak.c
    for (cur_byte = 0; cur_byte < format_desc_size; cur_byte++)
    {
        APP_USBD_CLASS_DESCRIPTOR_WRITE(audio_get_format_descriptor_data(p_inst, cur_byte));
    }

    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x06);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(36);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(2);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // jacktype
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // jackid
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0);

    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x06);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(36);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(2);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(2); // jacktype
    APP_USBD_CLASS_DESCRIPTOR_WRITE(2); // jackid
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0);

    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x09);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(36);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(3);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // jacktype
    APP_USBD_CLASS_DESCRIPTOR_WRITE(3); // jackid
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // numberOfPins
    APP_USBD_CLASS_DESCRIPTOR_WRITE(2); // sourceJackID
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // sourcePinID
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0);

    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x09);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(36);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(3);
    APP_USBD_CLASS_DESCRIPTOR_WRITE(2); // jacktype
    APP_USBD_CLASS_DESCRIPTOR_WRITE(4); // jackid
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // numberOfPins
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // sourceJackID
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // sourcePinID
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0);

    /* ENDPOINT GENERAL DESCRIPTOR */
    // APP_USBD_CLASS_DESCRIPTOR_WRITE(0x07); // bLength
    // APP_USBD_CLASS_DESCRIPTOR_WRITE(APP_USBD_AUDIO_DESCRIPTOR_ENDPOINT); // bDescriptorType = Audio Descriptor
    // APP_USBD_CLASS_DESCRIPTOR_WRITE(APP_USBD_AUDIO_EP_SUBTYPE_GENERAL);  // bDescriptorSubtype = EP General
    // APP_USBD_CLASS_DESCRIPTOR_WRITE(0x00); // bmAttributes
    // APP_USBD_CLASS_DESCRIPTOR_WRITE(0x00); // bLockDelayUnits
    // APP_USBD_CLASS_DESCRIPTOR_WRITE(LSB_16(0x0000)); // wLockDelay LSB
    // APP_USBD_CLASS_DESCRIPTOR_WRITE(MSB_16(0x0000)); // wLockDelay MSB







    /* ENDPOINT ISO DESCRIPTOR */
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x09); // bLength
    APP_USBD_CLASS_DESCRIPTOR_WRITE(APP_USBD_DESCRIPTOR_ENDPOINT); // bDescriptorType = Endpoint
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // bEndpointAddress
    APP_USBD_CLASS_DESCRIPTOR_WRITE(APP_USBD_DESCRIPTOR_EP_ATTR_TYPE_BULK); // bmAttributes
    APP_USBD_CLASS_DESCRIPTOR_WRITE(LSB_16(0x0040)); // wMaxPacketSize LSB
    APP_USBD_CLASS_DESCRIPTOR_WRITE(MSB_16(0x0040)); // wMaxPacketSize MSB
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x00); // bInterval
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x00); // bRefresh
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x00); // bSynchAddress

    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x05); // bSynchAddress
    APP_USBD_CLASS_DESCRIPTOR_WRITE(37); // bSynchAddress
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // bSynchAddress
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // bSynchAddress
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // bSynchAddress

    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x09); // bLength
    APP_USBD_CLASS_DESCRIPTOR_WRITE(APP_USBD_DESCRIPTOR_ENDPOINT); // bDescriptorType = Endpoint
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x81); // bEndpointAddress
    APP_USBD_CLASS_DESCRIPTOR_WRITE(APP_USBD_DESCRIPTOR_EP_ATTR_TYPE_BULK); // bmAttributes
    APP_USBD_CLASS_DESCRIPTOR_WRITE(LSB_16(0x0040)); // wMaxPacketSize LSB
    APP_USBD_CLASS_DESCRIPTOR_WRITE(MSB_16(0x0040)); // wMaxPacketSize MSB
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x00); // bInterval
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x00); // bRefresh
    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x00); // bSynchAddress

    APP_USBD_CLASS_DESCRIPTOR_WRITE(0x05); // bSynchAddress
    APP_USBD_CLASS_DESCRIPTOR_WRITE(37); // bSynchAddress
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // bSynchAddress
    APP_USBD_CLASS_DESCRIPTOR_WRITE(1); // bSynchAddress
    APP_USBD_CLASS_DESCRIPTOR_WRITE(2); // bSynchAddress

    APP_USBD_CLASS_DESCRIPTOR_END();
}

/** @} */

const app_usbd_class_methods_t app_usbd_audio_class_methods = {
    .event_handler       = audio_event_handler,
    .feed_descriptors    = audio_feed_descriptors,
    .iface_select        = iface_select,
    .iface_deselect      = iface_deselect,
    .iface_selection_get = iface_selection_get,
};


size_t app_usbd_audio_class_rx_size_get(app_usbd_class_inst_t const * p_inst)
{
    nrf_drv_usbd_ep_t ep_addr;

    ep_addr = ep_iso_addr_get(p_inst);
    ASSERT(NRF_USBD_EPISO_CHECK(ep_addr));

    return (size_t)nrf_drv_usbd_epout_size_get(ep_addr);
}


ret_code_t app_usbd_audio_class_rx_start(
    app_usbd_class_inst_t const * p_inst,
    void                        * p_buff,
    size_t                        size)
{
    nrf_drv_usbd_ep_t ep_addr;

    ep_addr = ep_iso_addr_get(p_inst);
    ASSERT(NRF_USBD_EPISO_CHECK(ep_addr));

    NRF_DRV_USBD_TRANSFER_OUT(transfer, p_buff, size);
    return app_usbd_ep_transfer(ep_addr, &transfer);
}

ret_code_t app_usbd_audio_class_tx_start(
    app_usbd_class_inst_t const * p_inst,
    const void                  * p_buff,
    size_t                        size)
{
    nrf_drv_usbd_ep_t ep_addr;

    ep_addr = ep_iso_addr_get(p_inst);
    ASSERT(NRF_USBD_EPISO_CHECK(ep_addr));

    // uint8_t asdf = 0x86;
    NRF_DRV_USBD_TRANSFER_IN(transfer, p_buff, size);
    // ret_code_t sdf = app_usbd_ep_transfer(asdf, &transfer);
    NRF_LOG_INFO("ep_addr: %d", ep_addr);
    ret_code_t sdf = app_usbd_ep_transfer(ep_addr, &transfer);
    NRF_LOG_INFO("return value: %d", sdf);
    return sdf;
}

ret_code_t app_usbd_audio_sof_interrupt_register(app_usbd_class_inst_t const * p_inst,
                                                 app_usbd_sof_interrupt_handler_t handler)
{
    app_usbd_audio_t const * p_audio     = audio_get(p_inst);
    app_usbd_audio_ctx_t   * p_audio_ctx = audio_ctx_get(p_audio);

    p_audio_ctx->sof_handler = handler;

    return NRF_SUCCESS;
}
